Repository: KarloK34/LinOS
Catalog: lib/l10n/app_*.arb
Languages: hr

# loginPage_title
source: Login
hr: Prijava

# loginPage_loginButton
source: Login
hr: Prijavi se

# loginPage_forgotPasswordButton
source: Forgot Password?
hr: Zaboravljena lozinka?

# loginPage_createAccountButton
source: Don't have an account? Register
hr: Nemate račun? Registriraj se

# loginPage_error_invalidCredentials
source: Invalid email or password.
hr: Nevažeća e-pošta ili lozinka.

# mainPage_unknownPage
source: Unknown Page
hr: Nepoznata stranica

# mainPage_homeLabel
source: Home
hr: Početna

# mainPage_ticketsLabel
source: Tickets
hr: Karte

# mainPage_linesLabel
source: Lines
hr: Linije

# mainPage_scheduleLabel
source: Schedule
hr: Vozni red

# mainPage_settingsLabel
source: Settings
hr: Postavke

# homePage_searchHint
source: Where do you want to go?
hr: Kamo želite ići?

# homePage_popularDestinationsTitle
source: Popular Destinations
hr: Popularna odredišta

# homePage_popularDestinationsSubtitle
source: Quick access to frequently visited places
hr: Brzi pristup često posjećenim mjestima

# homePage_osijekCitadelTitle
source: Osijek Citadel
hr: Osječka Tvrđa

# homePage_osijekCitadelSubtitle
source: Historical site
hr: Povijesno mjesto

# homePage_kingTomislavSquareTitle
source: King Tomislav Square
hr: Trg kralja Tomislava

# homePage_kingTomislavSquareSubtitle
source: Beautiful park
hr: Prekrasan park

# homePage_shoppingCenterTitle
source: Shopping Center
hr: Trgovački centar

# homePage_shoppingCenterSubtitle
source: Local shops and restaurants
hr: Lokalne trgovine i restorani

# homePage_startNavigationButton
source: Start Navigation
hr: Pokreni navigaciju

# homePage_noSuggestions
source: No suggestions available.
hr: Nema dostupnih prijedloga.

# homePage_noPopularDestinations
source: No popular destinations available.
hr: Nema dostupnih popularnih odredišta.

# homePage_navigationError
source: An error occurred while starting navigation.
hr: Došlo je do pogreške prilikom pokretanja navigacije.

# homePage_noDestinationError
source: Please select a destination to start navigation.
hr: Molimo odaberite odredište za pokretanje navigacije.

# homePage_locationError
source: Unable to access your location. Please check your device settings.
hr: Nije moguće pristupiti vašoj lokaciji. Provjerite postavke uređaja.

# linesPage_tramLinesTitle
source: Tram Lines
hr: Tramvajske linije

# linesPage_busLinesTitle
source: Bus Lines
hr: Autobusne linije

# linesPage_realTimeButton
source: Real-time Positions
hr: Položaji u stvarnom vremenu

# linesPage_viewScheduleButton
source: View Schedule
hr: Pogledaj vozni red

# schedulePage_tramScheduleTitle
source: Tram Schedule
hr: Vozni red tramvaja

# schedulePage_busScheduleTitle
source: Bus Schedule
hr: Vozni red autobusa

# schedulePage_favoriteStopsTitle
source: Favorite Stops
hr: Omiljene stanice

# schedulePage_addFavoriteButton
source: Add Favorite
hr: Dodaj omiljenu

# schedulePage_selectStopLabel
source: Select Stop
hr: Odaberi stanicu

# schedulePage_destinationColumn
source: Destination
hr: Odredište

# schedulePage_departureTimeColumn
source: Departure Time
hr: Vrijeme polaska

# settingsPage_myProfileTitle
source: My Profile
hr: Moj profil

# settingsPage_profileSettingsTitle
source: Profile Settings
hr: Postavke profila

# settingsPage_profileSettingsSubtitle
source: Manage your profile settings
hr: Upravljajte postavkama svog profila

# settingsPage_purchaseHistoryTitle
source: Purchase History
hr: Povijest kupovine

# settingsPage_purchaseHistorySubtitle
source: View your purchase history
hr: Pregledajte svoju povijest kupovine

# settingsPage_logoutTitle
source: Log out
hr: Odjava

# settingsPage_logoutSubtitle
source: Log out of your account
hr: Odjavite se sa svog računa

# settingsPage_languageRegionTitle
source: Language & Region
hr: Jezik i regija

# settingsPage_appLanguageTitle
source: App Language
hr: Jezik aplikacije

# settingsPage_appLanguageSubtitle
source: Select your preferred language
hr: Odaberite željeni jezik

# settingsPage_notificationsTitle
source: Notifications
hr: Obavijesti

# settingsPage_changeLanguageTitle
source: Change Language
hr: Promijeni jezik

# settingsPage_changeLanguageSubtitle
source: Select your preferred application language.
hr: Odaberite željeni jezik aplikacije.

# ticketsPage_generatedTicketCodeTitle
source: Generated Ticket Code
hr: Generirani kod karte

# ticketsPage_currentBalanceTitle
source: Current Balance
hr: Trenutno stanje

# ticketsPage_balanceLabel
source: Balance
hr: Stanje

# ticketsPage_buyDigitalTicketButton
source: Buy Digital Ticket
hr: Kupi digitalnu kartu

# ticketsPage_title
source: Tickets
hr: Karte

# ticketsPage_activeTicketsTitle
source: Active Tickets
hr: Aktivne karte

# ticketsPage_purchaseTicketsTitle
source: Purchase Tickets
hr: Kupi karte

# ticketsPage_purchasedTicketsTitle
source: Recent Purchases
hr: Nedavne kupnje

# ticketsPage_purchasedTicketsSubtitle
source: Your purchased tickets will appear here.
hr: Vaše kupljene karte će se pojaviti ovdje.

# ticketsPage_noActiveTickets
source: No active tickets
hr: Nema aktivnih karata

# ticketsPage_purchasePrompt
source: Purchase a ticket to get started
hr: Kupite kartu za početak

# ticketsPage_viewTicketHistoryLabel
source: View All History ({count} more)
hr: Prikaži svu povijest (još {count})

# ticketsPage_refresh
source: Refresh
hr: Osvježi

# activeTicketCard_validUntilLabel
source: Valid until:
hr: Vrijedi do:

# activeTicketCard_ticketIdLabel
source: Ticket ID:
hr: ID karte:

# activeTicketCard_tapToEnlarge
source: Tap to enlarge
hr: Dodirnite za povećanje

# activeTicketCard_expired
source: Expired
hr: Istekla

# activeTicketCard_active
source: Active
hr: Aktivna

# qrCodeModal_title
source: Ticket QR Code
hr: QR kod karte

# qrCodeModal_instructions
source: Show this code to the conductor when boarding
hr: Pokažite ovaj kod kondukteru pri ukrcaju

# qrCodeModal_ticketIdPrefix
source: Ticket ID:
hr: ID karte:

# balanceCard_selectAmountMessage
source: Select amount to add to your balance:
hr: Odaberite iznos za dodavanje na stanje:

# balanceCard_balanceAddedMessage
source: Added {amount} € to your balance
hr: Dodano {amount} € na vaše stanje

# purchaseButtons_confirmPurchaseTitle
source: Confirm Purchase
hr: Potvrdi kupnju

# purchaseButtons_confirmPurchaseMessage
source: Purchase {ticketType} for {price} €?
hr: Kupiti {ticketType} za {price} €?

# purchaseButtons_purchaseSuccessMessage
source: Ticket purchased successfully!
hr: Karta je uspješno kupljena!

# purchaseButtons_validForDays
source: Valid for {days} day
hr: Vrijedi {days} dan

# purchaseButtons_validForDaysPlural
source: Valid for {days} days
hr: Vrijedi {days} dana

# purchaseButtons_validForHours
source: Valid for {hours} hour
hr: Vrijedi {hours} sat

# purchaseButtons_validForHoursPlural
source: Valid for {hours} hours
hr: Vrijedi {hours} sati

# purchaseButtons_validForMinutes
source: Valid for {minutes} minutes
hr: Vrijedi {minutes} minuta

# ticketHistory_title
source: Ticket History
hr: Povijest karata

# ticketHistory_noTicketHistory
source: No ticket history
hr: Niste kupili nijednu kartu

# ticketHistory_errorLoadingHistory
source: Error loading history
hr: Greška pri učitavanju povijesti

# ticketHistory_loading
source: Loading...
hr: Učitavanje...

# ticketHistoryPage_title
source: Ticket History
hr: Povijest karata

# ticketHistoryPage_sortNewest
source: Newest First
hr: Najnovije prvo

# ticketHistoryPage_sortOldest
source: Oldest First
hr: Najstarije prvo

# ticketHistoryPage_sortPriceHigh
source: Price: High to Low
hr: Cijena: Visoka prema niskoj

# ticketHistoryPage_sortPriceLow
source: Price: Low to High
hr: Cijena: Niska prema visokoj

# ticketHistoryPage_ticketsCount
source: Number of Tickets:
hr: {count} karta

# ticketHistoryPage_totalSpent
source: Total spent: {amount} €
hr: Ukupno potrošeno: {amount} €

# ticketHistoryPage_noTicketsFound
source: No tickets found
hr: Nema pronađenih karata

# ticketHistoryPage_adjustFilters
source: Try adjusting your filters
hr: Pokušajte prilagoditi filtere

# ticketHistoryPage_clearFilters
source: Clear Filters
hr: Očisti filtere

# ticketHistoryPage_purchased
source: Purchased:
hr: Kupljeno:

# ticketHistoryPage_validUntil
source: Valid Until:
hr: Vrijedi do:

# ticketHistoryPage_duration
source: Duration
hr: Trajanje

# ticketHistoryPage_used
source: Used
hr: Iskorištena

# timeFormat_daysSingle
source: {days} day
hr: {days} dan

# timeFormat_daysPlural
source: {days} days
hr: {days} dana

# timeFormat_hoursSingle
source: {hours} hour
hr: {hours} sat

# timeFormat_hoursPlural
source: {hours} hours
hr: {hours} sati

# error_insufficientBalance
source: Insufficient balance. Please add funds to your account.
hr: Nedovoljno sredstava. Molimo dodajte sredstva na vaš račun.

# error_purchaseTicketFailed
source: Failed to purchase ticket: {error}
hr: Neuspješna kupnja karte: {error}

# error_addBalanceFailed
source: Failed to add balance: {error}
hr: Neuspješno dodavanje sredstava: {error}

# error_loadUserDataFailed
source: Failed to load user data: {error}
hr: Neuspješno učitavanje korisničkih podataka: {error}

source: Error loading tickets
hr: Greška pri učitavanju karata

# error_useTicketFailed
source: Failed to use ticket: {error}
hr: Neuspješno korištenje karte: {error}

# button_close
source: Close
hr: Zatvori

# button_retry
source: Retry
hr: Pokušaj ponovno

# cancelButton
source: Cancel
hr: Odustani

# confirmButton
source: Confirm
hr: Potvrdi

# emailHint
source: Email
hr: E-pošta

# passwordHint
source: Password
hr: Lozinka

# confirmPasswordHint
source: Confirm Password
hr: Potvrdi lozinku

# registerButton
source: Register
hr: Registriraj se

# registerPage_title
source: Create Account
hr: Registracija

# validation_emailCannotBeEmpty
source: Email cannot be empty.
hr: E-pošta ne smije biti prazna.

# validation_enterValidEmail
source: Enter a valid email address.
hr: Unesite valjanu adresu e-pošte.

# validation_passwordCannotBeEmpty
source: Password cannot be empty.
hr: Lozinka ne smije biti prazna.

# validation_passwordTooShort
source: Password must be at least 6 characters long.
hr: Lozinka mora imati najmanje 6 znakova.

# validation_confirmPasswordCannotBeEmpty
source: Confirm Password cannot be empty.
hr: Potvrda lozinke ne smije biti prazna.

# validation_passwordsDoNotMatch
source: Passwords do not match.
hr: Lozinke se ne podudaraju.

# validation_fixFormErrors
source: Please fix the form errors.
hr: Molimo ispravite pogreške u obrascu.

# validation_unexpectedErrorPrefix
source: An unexpected error occurred:
hr: Došlo je do neočekivane pogreške:

# auth_error_userNotFound
source: No user found with this email.
hr: Nije pronađen korisnik s ovom e-poštom.

# auth_error_wrongPassword
source: Wrong password provided.
hr: Pogrešna lozinka.

# auth_error_emailAlreadyInUse
source: Email is already in use.
hr: E-pošta se već koristi.

# auth_error_invalidEmail
source: Email address is invalid.
hr: Adresa e-pošte nije valjana.

# auth_error_weakPassword
source: Password is too weak.
hr: Lozinka je previše slaba.

# auth_error_userDisabled
source: This user has been disabled.
hr: Ovaj korisnik je onemogućen.

# auth_error_tooManyRequests
source: Too many attempts. Please try again later.
hr: Previše pokušaja. Molimo pokušajte kasnije.

# auth_error_default
source: An error occurred. Please try again.
hr: Došlo je do pogreške. Molimo pokušajte ponovno.

# forgotPassword_title
source: Forgot Password
hr: Zaboravljena lozinka

# forgotPassword_description
source: Enter your email to reset your password.
hr: Unesite svoju e-poštu da biste resetirali lozinku.

# forgotPassword_successMessage
source: Password reset successful. Please check your email for a new login link.
hr: Lozinka je resetirana. Molimo provjerite svoju e-poštu za novi link za prijavu.

# forgotPassword_resetButton
source: Reset Password
hr: Resetiraj lozinku

# registerPage_loginButton
source: Already have an account? Login
hr: Već imate račun? Prijavite se

# searchBar_startSearchHint
source: Start typing to search...
hr: Počnite tipkati za pretraživanje...

# searchBar_searching
source: Searching...
hr: Traženje...

# searchBar_error
source: An error occurred while searching. Please try again.
hr: Došlo je do pogreške prilikom pretraživanja. Molimo pokušajte ponovno.

source: Top Up Balance
hr: Nadoplati stanje

source: Single Ride
hr: Jednokratna vožnja

source: Daily Pass
hr: Dnevna karta

source: Weekly Pass
hr: Tjedna karta

source: Monthly Pass
hr: Mjesečna karta

source: All
hr: Sve
